Repository: OTech-Company/NutriScan
Catalog: NutriScan/NutriScan/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: ar

# accessibility.add_meal_tracking
source: Add meal to daily tracking
ar: إضافة الوجبة إلى التتبع اليومي

# accessibility.article_actions
source: Article actions
ar: إجراءات المقال

# accessibility.choose_history_date
source: Choose history date
ar: اختر تاريخ السجل

# accessibility.history_for
source: History for
ar: سجل تاريخ

# accessibility.loading_more_articles
source: Loading more articles
ar: جاري تحميل المزيد من المقالات

# accessibility.opens_article_details
source: Opens article details
ar: يفتح تفاصيل المقال

# accessibility.opens_personal_info
source: Opens Personal Information to set your calorie goal
ar: يفتح المعلومات الشخصية لتحديد هدف السعرات

# accessibility.opens_product_details
source: Opens Product Details
ar: يفتح تفاصيل المنتج

# accessibility.remove_date_filter
source: Remove date filter
ar: إزالة تصفية التاريخ

# accessibility.remove_from_saved
source: Remove from saved products
ar: إزالة من المنتجات المحفوظة

# accessibility.start_voice_chat
source: Start voice chat
ar: بدء المحادثة الصوتية

# accessibility.swipe_add_product
source: Swipe right or activate to add this saved product
ar: اسحب لليمين أو فعّل لإضافة هذا المنتج المحفوظ

# accessibility.switch_language
source: Switch language
ar: تبديل اللغة

# accessibility.view_details_for
source: View details for
ar: عرض تفاصيل

# accessibility.water_cup
source: Water cup
ar: كوب ماء

# accessibility.water_cup_hint
source: Tap to change consumed water. Long press to reduce the target.
ar: اضغط لتغيير استهلاك الماء. اضغط مطولاً لتقليل الهدف.

# auth.account_restoration.content_description
source: You can restore your account within the grace period to retain all your data and settings.
ar: يمكنك استعادة حسابك خلال فترة السماح للاحتفاظ ببياناتك وإعداداتك.

# auth.account_restoration.content_title
source: Account Deletion Pending
ar: الحساب في انتظار الحذف

# auth.account_restoration.days_remaining
source: Days remaining to restore:
ar: الأيام المتبقية للاستعادة:

# auth.account_restoration.failed_title
source: Action Failed
ar: فشلت العملية

# auth.account_restoration.header_subtitle
source: Your account is scheduled for deletion.
ar: حسابك مجدول للحذف.

# auth.account_restoration.header_title
source: Restore Account
ar: استعادة الحساب

# auth.account_restoration.log_out
source: Log Out
ar: تسجيل الخروج

# auth.account_restoration.restore_button
source: Restore My Account
ar: استعادة حسابي

# auth.account_restoration.scheduled_deletion
source: Scheduled Deletion Date:
ar: تاريخ الحذف المجدول:

# auth.account_restoration.want_to_exit
source: Want to exit?
ar: تريد الخروج؟

# auth.forgot_password.check_inbox
source: Please check your inbox and click the link to reset your password on the web.
ar: يرجى التحقق من صندوق الوارد الخاص بك والنقر على الرابط لإعادة تعيين كلمة المرور عبر الويب.

# auth.forgot_password.continue
source: Continue
ar: متابعة

# auth.forgot_password.email_placeholder
source: please enter your email
ar: أدخل بريدك الإلكتروني

# auth.forgot_password.email_title
source: Email Address
ar: البريد الإلكتروني

# auth.forgot_password.header_subtitle
source: Then let's submit password reset.
ar: لنقم بإعادة تعيين كلمة المرور.

# auth.forgot_password.header_title
source: Forgot Password?
ar: نسيت كلمة المرور؟

# auth.forgot_password.option_2fa_desc
source: Reset password via 2FA.
ar: إعادة تعيين كلمة المرور عبر 2FA.

# auth.forgot_password.option_2fa_title
source: Send via 2FA
ar: إرسال عبر المصادقة الثنائية

# auth.forgot_password.option_email_desc
source: Reset password via email.
ar: إعادة تعيين كلمة المرور عبر البريد.

# auth.forgot_password.option_email_title
source: Send via Email
ar: إرسال عبر البريد الإلكتروني

# auth.forgot_password.option_gauth_desc
source: Reset password via G-Auth.
ar: إعادة تعيين كلمة المرور عبر G-Auth.

# auth.forgot_password.option_gauth_title
source: Send via Google Auth
ar: إرسال عبر Google Auth

# auth.forgot_password.option_sms_desc
source: Reset password via SMS.
ar: إعادة تعيين كلمة المرور عبر SMS.

# auth.forgot_password.option_sms_title
source: Send via SMS
ar: إرسال عبر الرسائل النصية

# auth.forgot_password.resend_link
source: Resend Link
ar: إعادة إرسال الرابط

# auth.forgot_password.reset_description
source: Enter the email address associated with your account. We will send you a secure link to reset your password on our web portal.
ar: أدخل البريد الإلكتروني المرتبط بحسابك وسنرسل لك رابطاً لإعادة تعيين كلمة المرور.

# auth.forgot_password.reset_link_sent_desc
source: We've sent a secure password reset link to:
ar: لقد أرسلنا رابط إعادة تعيين كلمة المرور بأمان إلى:

# auth.forgot_password.reset_link_sent_title
source: Reset Link Sent!
ar: تم إرسال رابط الاسترداد!

# auth.forgot_password.reset_title
source: Reset Password
ar: إعادة تعيين كلمة المرور

# auth.forgot_password.send_reset_link
source: Send Reset Link
ar: إرسال رابط الاسترداد

# auth.login.email_placeholder
source: Enter your email
ar: أدخل بريدك الإلكتروني

# auth.login.email_title
source: Email Address
ar: البريد الإلكتروني

# auth.login.failed_title
source: Login Failed
ar: فشل تسجيل الدخول

# auth.login.failed_unknown
source: An unknown error occurred
ar: حدث خطأ غير معروف

# auth.login.forgot_password
source: Forgot Password?
ar: نسيت كلمة المرور؟

# auth.login.no_account
source: Don't have an account?
ar: ليس لديك حساب؟

# auth.login.or
source: OR
ar: أو

# auth.login.password_placeholder
source: Enter your password
ar: أدخل كلمة المرور

# auth.login.password_title
source: Password
ar: كلمة المرور

# auth.login.sign_in
source: Sign in
ar: تسجيل الدخول

# auth.login.sign_up
source: Sign Up.
ar: إنشاء حساب.

# auth.login.title
source: Sign In
ar: تسجيل الدخول

# auth.login.try_again
source: Try Again
ar: حاول مرة أخرى

# auth.register.already_have_account
source: Already have an account?
ar: لديك حساب بالفعل؟

# auth.register.confirm_password_placeholder
source: Repeat password
ar: أعد إدخال كلمة المرور

# auth.register.confirm_password_title
source: Password Confirmation
ar: تأكيد كلمة المرور

# auth.register.email_placeholder
source: Enter your email
ar: أدخل بريدك الإلكتروني

# auth.register.email_title
source: Email Address
ar: البريد الإلكتروني

# auth.register.failed_title
source: Registration Failed
ar: فشل إنشاء الحساب

# auth.register.first_name_placeholder
source: Enter your first name...
ar: أدخل اسمك الأول...

# auth.register.first_name_title
source: First Name
ar: الاسم الأول

# auth.register.last_name_placeholder
source: Enter your last name...
ar: أدخل اسم العائلة...

# auth.register.last_name_title
source: Last Name
ar: اسم العائلة

# auth.register.password_placeholder
source: Enter your password
ar: أدخل كلمة المرور

# auth.register.password_title
source: Password
ar: كلمة المرور

# auth.register.sign_in
source: Sign In.
ar: تسجيل الدخول.

# auth.register.sign_up
source: Sign Up
ar: إنشاء حساب

# auth.register.success_description
source: Your account has been created successfully.
ar: تم إنشاء حسابك بنجاح.

# auth.register.success_title
source: Registration Success
ar: تم إنشاء الحساب!

# auth.register.title
source: Sign Up For Free!
ar: إنشاء حساب مجاناً!

# auth.verification.did_not_receive
source: Didn't receive it?
ar: لم تستلمه؟

# auth.verification.go_to_sign_in
source: Go to Sign In
ar: الانتقال لتسجيل الدخول

# auth.verification.header_subtitle
source: Confirm it's you to start scanning.
ar: أكّد هويتك لبدء المسح الضوئي.

# auth.verification.header_title
source: Verify Your Email
ar: تحقق من بريدك الإلكتروني

# auth.verification.instructions
source: Please check your email and click the verification link to activate your account. After verifying, you can sign in below.
ar: يرجى التحقق من بريدك الإلكتروني والنقر على رابط التحقق لتفعيل حسابك. بعد التحقق، يمكنك تسجيل الدخول.

# auth.verification.link_sent_to
source: A verification link was sent to:
ar: تم إرسال رابط التحقق إلى:

# auth.verification.resend_email
source: Resend Verification Email.
ar: إعادة إرسال بريد التحقق.

# auth.verification.resend_email_in
source: Resend email in
ar: إعادة الإرسال خلال

# auth.verification.sent_title
source: Verification Email Sent
ar: تم إرسال بريد التحقق

# calories_history.filter_by_date
source: Filter by Date
ar: تصفية حسب التاريخ

# calories_history.incomplete_response
source: The calorie history response is incomplete.
ar: استجابة سجل السعرات الحرارية غير مكتملة.

# calories_history.not_found
source: No calorie history was found for this date.
ar: لم يتم العثور على سجل سعرات حرارية لهذا التاريخ.

# calories.add_food
source: Add Food
ar: إضافة طعام

# calories.apply_date
source: Apply Date
ar: تطبيق التاريخ

# calories.calorie_goals
source: Calorie Goals
ar: أهداف السعرات

# calories.calories_burned
source: Calories Burned
ar: السعرات المحروقة

# calories.calories_gained
source: Calories Gained
ar: السعرات المكتسبة

# calories.complete_personal_info
source: Complete Personal Information
ar: إكمال المعلومات الشخصية

# calories.cups
source: cups
ar: أكواب

# calories.daily_products
source: Daily Products
ar: منتجات اليوم

# calories.history_date
source: History date
ar: تاريخ السجل

# calories.history_title
source: Calories History
ar: سجل السعرات

# calories.min_today
source: min today
ar: دقيقة اليوم

# calories.motion_fitness_title
source: Motion & Fitness
ar: الحركة واللياقة البدنية

# calories.notice
source: Notice
ar: إشعار

# calories.permission_required
source: Permission required
ar: مطلوب إذن الوصول

# calories.remove_meal_desc
source: All servings of this meal will be removed from today's log.
ar: سيتم إزالة جميع حصص هذه الوجبة من سجل اليوم.

# calories.remove_meal_title
source: Remove Meal?
ar: إزالة الوجبة؟

# calories.remove_one_serving_desc
source: One serving will be removed from today's log.
ar: سيتم إزالة حصة واحدة من سجل اليوم.

# calories.remove_one_serving_title
source: Remove One Serving?
ar: إزالة حصة واحدة؟

# calories.remove_target_cup_desc
source: This will reduce your daily water goal by 1 cup.
ar: سيؤدي هذا إلى تقليل هدفك اليومي من الماء بمقدار كوب واحد.

# calories.remove_target_cup_title
source: Remove Target Cup?
ar: تقليل الكوب المستهدف؟

# calories.remove_water_desc
source: Do you want to mark this cup as undrunk?
ar: هل تريد إلغاء شرب هذا الكوب؟

# calories.remove_water_title
source: Remove Water?
ar: إزالة الماء؟

# calories.total_meals
source: Total Meals
ar: إجمالي الوجبات

# calories.unknown_product
source: Unknown Product
ar: منتج غير معروف

# calories.water
source: Water
ar: الماء

# calories.your_tdee
source: Your TDEE
ar: احتياجك اليومي (TDEE)

# common.action_failed
source: Action Failed
ar: فشلت العملية

# common.back
source: Back
ar: رجوع

# common.cancel
source: Cancel
ar: إلغاء

# common.continue
source: Continue
ar: متابعة

# common.delete
source: Delete
ar: حذف

# common.dismiss
source: Dismiss
ar: إغلاق

# common.done
source: Done
ar: تم

# common.edit
source: Edit
ar: تعديل

# common.error
source: Error
ar: خطأ

# common.field_required
source: This field is required
ar: هذا الحقل مطلوب

# common.height
source: Height
ar: الطول

# common.logout
source: Log Out
ar: تسجيل الخروج

# common.no_internet_connection
source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

# common.ok
source: OK
ar: حسناً

# common.other
source: Other
ar: آخر

# common.retry
source: Retry
ar: إعادة المحاولة

# common.save
source: Save
ar: حفظ

# common.share
source: Share
ar: مشاركة

# common.something_went_wrong
source: Something Went Wrong
ar: حدث خطأ ما

# common.start
source: Start
ar: ابدأ

# common.try_again
source: Try Again
ar: حاول مرة أخرى

# common.unknown_error
source: An unknown error occurred
ar: حدث خطأ غير معروف

# common.weight
source: Weight
ar: الوزن

# edit_profile.discard
source: Discard
ar: تجاهل

# edit_profile.save_changes_desc
source: You have modified your profile data. Are you sure you want to save these changes?
ar: لقد قمت بتعديل بيانات ملفك الشخصي. هل أنت متأكد من حفظ التغييرات؟

# empty_state.action_add_meals
source: Add Meals
ar: إضافة وجبات

# empty_state.action_go_back
source: Go Back
ar: الرجوع

# empty_state.action_go_to_home
source: Go to Home
ar: الذهاب للرئيسية

# empty_state.action_go_to_scan
source: Go to Scan
ar: الذهاب للمسح

# empty_state.action_go_to_scans
source: Go to Scans
ar: الذهاب للمسح

# empty_state.action_go_to_settings
source: Go to Settings
ar: الذهاب للإعدادات

# empty_state.action_start_scanning
source: Start Scanning
ar: بدء المسح

# empty_state.action_try_again
source: Try Again
ar: حاول مرة أخرى

# empty_state.desc_error_404
source: Oops! The page you're looking for can't be found.
ar: عفواً! الصفحة التي تبحث عنها غير موجودة.

# empty_state.desc_no_calories_history
source: Start tracking your calories to see your daily progress.
ar: ابدأ بتتبع سعراتك الحرارية لرؤية تقدمك اليومي.

# empty_state.desc_no_connection
source: Oops! It seems you're currently offline.
ar: عفواً! يبدو أنك غير متصل بالإنترنت حالياً.

# empty_state.desc_no_notifications
source: No new notifications right now. We'll let you know when something important needs your attention.
ar: لا توجد إشعارات جديدة الآن. سنخبرك عندما يحتاج شيء مهم لانتباهك.

# empty_state.desc_no_saved
source: You have nothing on your list yet. It's never too late to change it :)
ar: لا يوجد شيء في قائمتك بعد. لم يفت الأوان لتغيير ذلك :)

# empty_state.desc_no_scans
source: Start your first scan to see whether a product is safe for you.
ar: ابدأ أول عملية مسح لمعرفة ما إذا كان المنتج آمناً لك.

# empty_state.desc_no_search_results
source: No results found. Please try again.
ar: لم يتم العثور على نتائج. يرجى المحاولة مرة أخرى.

# empty_state.desc_notification_permission
source: Enable notifications to receive scan updates, reminders, and important health alerts.
ar: قم بتفعيل الإشعارات لتلقي تحديثات المسح، التذكيرات والتنبيهات الصحية الهامة.

# empty_state.desc_server_problem
source: We're having trouble loading your data. Please try again in a moment.
ar: نواجه مشكلة في تحميل بياناتك. يرجى المحاولة مرة أخرى بعد لحظات.

# empty_state.title_error_404
source: Error 404
ar: خطأ 404

# empty_state.title_no_calories_history
source: No Calories History
ar: لا يوجد سجل للسعرات

# empty_state.title_no_connection
source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

# empty_state.title_no_notifications
source: No Notifications
ar: لا توجد إشعارات

# empty_state.title_no_saved
source: No Saved scans
ar: لا توجد عمليات مسح محفوظة

# empty_state.title_no_scans
source: No Scans yet
ar: لا توجد عمليات مسح بعد

# empty_state.title_no_search_results
source: No results found
ar: لم يتم العثور على نتائج

# empty_state.title_notification_permission
source: Turn on notifications
ar: تفعيل الإشعارات

# empty_state.title_server_problem
source: Server problem
ar: مشكلة في الخادم

# exercise.cancel
source: Cancel workout
ar: إلغاء التمرين

# exercise.cancel_workout_desc
source: Are you sure you want to quit? Your current workout progress will be lost.
ar: هل أنت تأكد من رغبتك في الخروج؟ سيفقد تقدمك الحالي في التمرين.

# exercise.cancel_workout_title
source: Cancel Workout?
ar: إلغاء التمرين؟

# exercise.end_workout
source: End Workout
ar: إنهاء التمرين

# exercise.finish
source: Finish
ar: إنهاء

# exercise.instructions
source: Instructions
ar: التعليمات

# exercise.keep_going
source: Keep Going
ar: مواصلة التمرين

# exercise.label
source: Exercise
ar: التمرين

# exercise.no_exercises
source: No exercises found
ar: لم يتم العثور على تمارين

# exercise.pause
source: Pause
ar: إيقاف مؤقت

# exercise.read_more
source: read more
ar: اقرأ المزيد

# exercise.reps
source: Reps
ar: تكرارات

# exercise.restart
source: Restart
ar: إعادة التشغيل

# exercise.restart_timer_desc
source: This will reset your workout timer back to 00:00.
ar: سيؤدي هذا إلى إعادة ضبط مؤقت التمرين إلى 00:00.

# exercise.restart_timer_title
source: Restart Timer?
ar: إعادة تشغيل المؤقت؟

# exercise.resume
source: Resume
ar: استئناف

# exercise.search_placeholder
source: Search exercises...
ar: البحث في التمارين...

# exercise.sets
source: Sets
ar: مجموعات

# exercise.start_workout
source: Start Workout
ar: بدء التمرين

# exercise.title
source: Exercises
ar: التمارين

# exercise.total_time
source: Total Time
ar: الوقت الإجمالي

# exercise.try_adjusting_search
source: Try adjusting your search or choose a different category
ar: جرب تعديل البحث أو اختر فئة مختلفة

# exercise.workout_completed_title
source: Workout Completed!
ar: تم الانتهاء من التمرين!

# favorites.added
source: Added!
ar: تمت الإضافة!

# favorites.adding
source: Adding...
ar: جاري الإضافة...

# favorites.couldnt_add_meal_title
source: Couldn't Add Meal
ar: تعذر إضافة الوجبة

# favorites.empty_desc
source: Scan and save your favorite products to see them here.
ar: امسح واحفظ منتجاتك المفضلة لتظهر هنا.

# favorites.empty_title
source: No Saved Scans
ar: لا توجد منتجات محفوطة

# favorites.kcal
source: Kcal
ar: سعرة

# favorites.no_internet_desc
source: Please check your connection and try again.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# favorites.ready
source: Ready
ar: جاهز

# favorites.remove_product_desc
source: Are you sure you want to remove this product from your favorites?
ar: هل أنت متأكد من إزالة هذا المنتج من مفضلتك؟

# favorites.remove_product_title
source: Remove Product
ar: إزالة المنتج

# home.chat_with_ai
source: Chat with AI
ar: محادثة الذكاء الاصطناعي

# home.check_nutritional_facts
source: Check nutritional facts instantly
ar: تحقق من الحقائق الغذائية فوراً

# home.daily_health_tip
source: Daily Health Tip
ar: نصيحة صحية يومية

# home.default_daily_tip
source: Stay hydrated! Drink at least 8 glasses of water today.
ar: حافظ على رطوبة جسمك! اشرب 8 أكواب من الماء على الأقل اليوم.

# home.delete_failed_title
source: Delete Failed
ar: فشل الحذف

# home.delete_scan_desc
source: This scan will be removed from your history.
ar: سيتم إزالة هذا السجل من تاريخ المسح الخاص بك.

# home.delete_scan_title
source: Delete Scan?
ar: حذف المسح؟

# home.explore
source: Explore
ar: استكشف

# home.health_comes_first
source: Your Health Comes First
ar: صحتك تأتي أولاً

# home.health_news
source: Health News
ar: الأخبار الصحية

# home.ready_to_scan
source: Ready to scan?
ar: جاهز للمسح الضوئي؟

# home.recent_history
source: Recent History
ar: السجل الحديث

# home.view_all
source: View All
ar: عرض الكل

# news.clear_search
source: Clear Search
ar: مسح البحث

# news.couldnt_load_articles_desc
source: Couldn't load more articles. Please try again.
ar: تعذر تحميل المزيد من المقالات. يرجى المحاولة مرة أخرى.

# news.no_connection_pagination_desc
source: No connection. Check your internet and try again.
ar: لا يوجد اتصال. تحقق من شبكة الإنترنت وحاول مرة أخرى.

# news.no_news
source: No news yet
ar: لا توجد أخبار بعد

# news.no_news_desc
source: There are no health stories available right now. Check back in a moment.
ar: لا تتوفر مقالات صحية حالياً. يرجى التحقق لاحقاً.

# news.open_article
source: Open Article
ar: فتح المقال

# news.read_full_article
source: Read Full Article
ar: قراءة المقال كاملاً

# news.title
source: News
ar: الأخبار الصحيات

# notifications.category_break_time
source: Break Time
ar: وقت الاستراحة

# notifications.category_food_log
source: Food Log
ar: سجل الطعام

# notifications.category_health_news
source: Health News
ar: الأخبار الصحية

# notifications.category_health_quotes
source: Health Quotes
ar: الحكم الصحية

# notifications.category_scan_reminders
source: Scan Reminders
ar: تذكيرات المسح

# notifications.category_steps
source: Steps
ar: الخطوات

# notifications.category_streak
source: Streak
ar: التتابع

# notifications.category_water
source: Water
ar: الماء

# notifications.category_workout
source: Workout
ar: التمارين

# notifications.clear_all
source: Clear All
ar: مسح الكل

# notifications.clear_all_desc
source: Are you sure you want to delete all notification history? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف جميع سجلات الإشعارات؟ لا يمكن التراجع عن هذا الإجراء.

# notifications.clear_all_title
source: Clear All Notifications
ar: مسح جميع الإشعارات

# notifications.do_not_disturb
source: Do not disturb
ar: عدم الإزعاج

# notifications.empty_desc
source: You're all caught up! When you receive reminders or updates, they will appear here.
ar: أنت مطلع على كل جديد! عندما تتلقى تذكيرات ستظهر هنا.

# notifications.empty_title
source: No Notifications Yet
ar: لا توجد إشعارات بعد

# notifications.notification_settings
source: Notification Settings
ar: إعدادات الإشعارات

# notifications.section_content
source: Content & News
ar: المحتوى والأخبار

# notifications.section_fitness
source: Fitness & Tracking
ar: اللياقة والتتبع

# notifications.section_reminders
source: Reminders
ar: التذكيرات

# onboarding.back
source: BACK
ar: السابق

# onboarding.know_whats_safe_desc
source: Get a personalized safety rating based on your allergies and health conditions, with simple explanations you can trust.
ar: احصل على تقييم أمان مخصص استناداً إلى حساسيتك وظروفك الصحية مع تفسيرات بسيطة يمكنك الثقة بها.

# onboarding.know_whats_safe_title
source: Know What's Safe for You
ar: اعرف ما هو الآمن لك

# onboarding.lets_start
source: Let's Start
ar: لنبدأ

# onboarding.next
source: Next
ar: التالي

# onboarding.scan_labels_desc
source: Point your camera at any food label and let AI read even the smallest Arabic and English ingredients in seconds.
ar: وجه كاميرتك نحو أي ملصق طعام ودع الذكاء الاصطناعي يقرأ أصغر المكونات بالعربية والإنجليزية في ثوانٍ.

# onboarding.scan_labels_title
source: Scan Food Labels Instantly
ar: مسح ملصقات الطعام فورياً

# onboarding.shop_with_confidence_desc
source: Discover healthier alternatives, avoid hidden risks, and make smarter food choices every time you shop.
ar: اكتشف بدائل صحية، وتجنب المخاطر الخفية، واختبر خيارات غذائية أذكى في كل مرة تتسوق فيها.

# onboarding.shop_with_confidence_title
source: Shop with Confidence
ar: تسوق بكل ثقة

# onboarding.skip
source: SKIP
ar: تخطي

# personal_info.title
source: Personal Information
ar: المعلومات الشخصية

# product_details.calories
source: Calories
ar: السعرات

# product_details.carbs
source: Carbs
ar: الكربوهيدرات

# product_details.failed_update_favorite
source: Failed to update favorite status.
ar: فشل تحديث حالة المفضلة.

# product_details.fat
source: Fat
ar: الدهون

# product_details.fiber
source: Fiber
ar: الألياف

# product_details.for_you
source: For you
ar: من أجلك

# product_details.protein
source: Protein
ar: البروتين

# product_details.scan_failed
source: Scan Failed
ar: فشل المسح

# product_details.scanned_at
source: Scanned at
ar: تم المسح في

# product_details.sodium
source: Sodium
ar: الصوديوم

# product_details.sugar
source: Sugar
ar: السكر

# product_details.title
source: Product Details
ar: تفاصيل المنتج

# product_details.why_its
source: Why It's
ar: لماذا هو

# profile_setup.allergies
source: Allergies
ar: الحساسية الغذائية

# profile_setup.chronic_conditions
source: Chronic Conditions
ar: الأمراض المزمنة

# profile_setup.female
source: Female
ar: أنثى

# profile_setup.health_profile_subtitle
source: Help us tailor NutriScan to your specific dietary needs and health conditions.
ar: ساعدنا في تخصيص NutriScan لاحتياجاتك الغذائية والظروف الصحية الخاصة بك.

# profile_setup.health_profile_title
source: Setup Your Health Profile
ar: إعداد ملفك الصحي

# profile_setup.height_description
source: We'll use your height to personalize your nutrition insights and calorie calculations.
ar: سنستخدم طولك لتخصيص تحليلاتك الغذائية وحساب السعرات الحرارية.

# profile_setup.invalid_age
source: Invalid Age
ar: العمر غير صالح

# profile_setup.invalid_age_desc
source: Your age must be at least 6 years.
ar: يجب أن يكون عمرك 6 سنوات على الأقل.

# profile_setup.invalid_age_title
source: Invalid Age
ar: عمر غير صالح

# profile_setup.male
source: Male
ar: ذكر

# profile_setup.save
source: Save
ar: حفظ

# profile_setup.saving
source: Saving...
ar: جاري الحفظ...

# profile_setup.search_allergies
source: Search Allergies
ar: البحث عن الحساسية
